app/controllers/usuario_controller.rb

SELECT id,usuario,nombre,apellido,twitter FROM "usuarios"
SELECT COUNT(*) FROM "usuarios"
---
  def index
    @users = Usuario.all
    total = Usuario.all.count

UPDATE "usuarios" SET "apellido" = $1, "updated_at" = $2 WHERE "usuarios"."id" = $3  [["apellido", "javieres"], ["updated_at", 2017-03-26 08:56:01 UTC], ["id", 1]]
---
  def update
    if(params.has_key?(:id))
      render json: { error: 'id no es modificable' }, status: 400
    else
      if @user.update_attributes(usuario_params)

INSERT INTO "usuarios" ("usuario", "nombre", "apellido", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["usuario", "ji"], ["nombre", "Juan"], ["apellido", "Integrador"], ["created_at", 2017-03-31 00:50:11 UTC], ["updated_at", 2017-03-31 00:50:11 UTC]]
---
  def create
    if(params.has_key?(:id))
      render json: { error: 'No se puede crear usuario con id' }, status: 400
    else
      if(params.has_key?(:usuario)&& params.has_key?(:nombre))
        @newUser = Usuario.new(usuario_params)
        if @newUser.save

SELECT  id, nombre, apellido, usuario, twitter FROM "usuarios" WHERE "usuarios"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_usuario
        @user = Usuario.find(params[:id])